app/Controllers/Home.php

SELECT *
FROM `tbl_user`
---
    public function buat()
    {
        $userModel = new UserModel();
        $user = $userModel->find();
        $suratModel = new SuratModel();
        $jumlahSurat = $suratModel->jumlahsurat();
        $today = date("Y-m-d");




        $data = [
            'content' => 'surat/buat_internal',
            'nama' => session()->get('nama_user'),

SELECT *
FROM `tbl_user`
---
    public function profile()
    {
        // print_r(session()->get());
        // $nama = session()->get('nama_user');
        $data = [
            'content' => 'admin/v_profile',
            'nama' => session()->get('nama_user')
        ];

SELECT *
FROM `tbl_user`
---
    public function v_superadmin()
    {
        // print_r(session()->get());
        // $nama = session()->get('nama_user');
        $suratModel = new SuratModel();
        $jumlahSurat = $suratModel->jumlahsurat();
        $data = [
            'content' => 'admin/sa_dashboard',
            'role' => 'Super Admin',
            'nama' => session()->get('nama_user'),
            'jumlah_surat' => $jumlahSurat
        ];

SELECT *
FROM `tbl_user`
---
    public function infouser()
    {
        // print_r(session()->get());
        // $nama = session()->get('nama_user');
        $userModel = new UserModel();
        $user = $userModel->find();

SELECT *
FROM `tbl_user`
WHERE `id_user` = '5'
 LIMIT 1
---
    public function edit_akun($id)
    {
        helper('form');
        $userModel = new UserModel();
        $data = [

            'content' => 'user/edit_akun',
            'nama' => session()->get('nama_user'),
            'user' => $userModel->where('id_user', $id)->first()
        ];