app/Controllers/surat.php

SELECT *
FROM `tbl_user`
---
    public function infosurat()
    {
        $suratModel = new SuratModel();
        $jumlahSurat = $suratModel->jumlahsurat();
        $suratModel = new SuratModel();
        $surat = $suratModel->find();
        $userModel = new UserModel();
        $user = $userModel->find();
        // print_r($surat);
        $data = [
            'content' => 'surat/v_surat',
            'nama' => session()->get('nama_user'),
            'surat' => $surat,
            'jumlah_surat' => $jumlahSurat,
            'user' => $user
        ];

SELECT *
FROM `tbl_user`
---
    public function info_surat()
    {
        $suratModel = new SuratModel();
        $jumlahSurat = $suratModel->jumlahsurat();
        $suratModel = new SuratModel();
        $surat = $suratModel->find();
        $userModel = new UserModel();
        $user = $userModel->find();
        // print_r($surat);
        $data = [
            'content' => 'surat/info_surat',
            'nama' => session()->get('nama_user'),
            'surat' => $surat,
            'jumlah_surat' => $jumlahSurat,
            'user' => $user
        ];

SELECT *
FROM `tbl_user`
---
    public function edit_surat($id)
    {
        helper('form');
        if (!$this->validate([
            'kepada' => 'required',
            'pembuat' => 'required',
            'sifat' => 'required',
            'hal' => 'required',
            'tembusan' => 'permit_empty',
            'lampiran' => 'required',
            'tanggal' => 'required',
            'isi' => 'required'
        ])) {
        }

        $userModel = new UserModel();
        $user = $userModel->find();