app/Controllers/surat.php

    public function info_surat()
    {
        // print_r(session()->get());
        $suratModel = new SuratModel();
        $jumlahSurat = $suratModel->jumlahsurat();
        $suratModel = new SuratModel();
        $userLogin = session()->get('nama_user');
        $surat = $suratModel->where('pembuat', $userLogin)->findAll();
        $userModel = new UserModel();
        $user = $userModel->find();
---
SELECT *
FROM `tbl_user`

    public function e_surat($id)
    {
        helper('form');
        if (!$this->validate([
            'kepada' => 'required',
            'pembuat' => 'required',
            'sifat' => 'required',
            'hal' => 'required',
            'tembusan' => 'permit_empty',
            'lampiran' => 'required',
            'tanggal' => 'required',
            'isi' => 'required'
        ])) {
        }

        $userModel = new UserModel();
        $user = $userModel->find();
---
SELECT *
FROM `tbl_user`