app/Models/M_Auth.php

INSERT INTO `tbl_user` (`nama_user`, `email`, `no_hp`, `level`, `password`) VALUES ('young', 'young@gmail.com', '456789', '3', '$2y$10$cljLC0GjkHstgrO7LkV/seZQCgljYmZiMYtSmzqFP8la.7GOoMnRO')
---
    public function sv_register($data)
    {
        $this->db->table('tbl_user')->insert($data);