app/Models/usermodel.php

SELECT COUNT(*) AS `numrows` FROM `tbl_user`
---
    public function jumlahUser()
    {
        return $this->countAll();